; domain
(define (domain robo-doctor_2)
(:requirements :typing :negative-preconditions)
(:types robot person location box content carrier capacity_number)

(:predicates
    (capacity ?cr - carrier ?cp - capacity_number)
    (capacity_predecessor ?cp_prev - capacity_number ?cp_succ - capacity_number)
    (robot-at ?r - robot ?x - location)
    (carrier-at ?cr - carrier ?x - location)
    (carrier-has ?cr - carrier ?b - box)
    (content-at ?c - content ?x - location)
    (box-at ?b - box ?x - location)
    (box-contains ?b - box ?c - content)
    (person-at ?p - person ?x - location)
    (person-has ?p - person ?c - content)
    (box-full ?b - box)
    )

(:action fill
    :parameters (?r - robot ?b - box ?c - content ?x - location)
    :precondition (and  (robot-at ?r ?x)
                        (box-at ?b ?x)
                        (content-at ?c ?x)
                        (not(box-full ?b)))
    :effect (and        (box-full ?b)
                        (box-contains ?b ?c)))

(:action load
    :parameters (?r - robot ?x - location ?b - box ?cr - carrier ?cp_prev - capacity_number ?cp_succ - capacity_number)
    :precondition (and  (robot-at ?r ?x)
                        (box-at ?b ?x)
                        (capacity_predecessor ?cp_prev ?cp_succ)
                        (capacity ?cr ?cp_succ))
    :effect (and        (carrier-has ?cr ?b)
                        (not(box-at ?b ?x))
                        (not(capacity ?cr ?cp_succ))
                        (capacity ?cr ?cp_prev)))

(:action move
    :parameters (?r - robot ?cr - carrier ?x1 - location ?x2 - location)
    :precondition (and  (robot-at ?r ?x1)
                        (not(robot-at ?r ?x2))
                        (carrier-at ?cr ?x1)
                        (not(carrier-at ?cr ?x2)))
    :effect (and        (robot-at ?r ?x2)
                        (not(robot-at ?r ?x1))
                        (carrier-at ?cr ?x2)
                        (not(carrier-at ?cr ?x1))))


(:action unload
    :parameters (?r - robot ?x - location ?b - box ?cr - carrier ?cp_prev - capacity_number ?cp_succ - capacity_number)
    :precondition (and  (robot-at ?r ?x)
                        (carrier-at ?cr ?x)
                        (carrier-has ?cr ?b)
                        (capacity_predecessor ?cp_prev ?cp_succ)
                        (capacity ?cr ?cp_prev)
                        )
    :effect (and        (box-at ?b ?x)
                        (capacity ?cr ?cp_succ)
                        (not(capacity ?cr ?cp_prev))
                        (not(carrier-has ?cr ?b))))

(:action empty
    :parameters (?r - robot ?x - location ?b - box ?c - content ?p - person)
    :precondition (and  (robot-at ?r ?x)
                        (box-at ?b ?x)
                        (box-contains ?b ?c)
                        (person-at ?p ?x))
    :effect (and        (not(box-contains ?b ?c))
                        (person-has ?p ?c)
                        (not(box-full ?b))))
)

; problem
(define (problem robo-doctor_2) (:domain robo-doctor_2)
(:objects 
    robot1                                              - robot
    person1 person2 person3 person4 person5 person6     - person
    depot loc1 loc2 loc3 loc4 loc5 loc6 loc7            - location
    box1 box2 box3 box4 box                             - box
    xanax bendage banana pizza hammer                   - content
    carrier1                                            - carrier
    capacity_0                                          - capacity_number
    capacity_1                                          - capacity_number
    capacity_2                                          - capacity_number
    capacity_3                                          - capacity_number
    capacity_4                                          - capacity_number
)

(:init
    (capacity carrier1 capacity_4)
    (person-at person1 loc1)
    (person-at person2 loc3)
    (person-at person3 loc4)
    (person-at person4 loc7)
    (person-at person5 loc2)
    (person-at person6 loc6)
    (carrier-at carrier1 depot)
    (robot-at robot1 depot)
    (box-at box1 depot)
    (box-at box2 depot)
    (box-at box3 depot)
    (box-at box4 depot)
    (content-at xanax depot)
    (content-at bendage depot)
    (content-at banana depot)
    (content-at pizza depot)
    (content-at hammer depot)
    (capacity_predecessor capacity_0 capacity_1)
    (capacity_predecessor capacity_1 capacity_2)
    (capacity_predecessor capacity_2 capacity_3)
    (capacity_predecessor capacity_3 capacity_4)
    )

(:goal (and
    (person-has person1 hammer)
    (person-has person2 banana)
    (person-has person3 xanax)
    (person-has person3 hammer)
    (person-has person5 bendage)
    (person-has person6 bendage)
    (person-has person6 pizza)
    (person-has person6 xanax)
))
)

; plan
1. (fill robot1 box1 hammer depot)
   added: (box-full box1) (box-contains box1 hammer)
   goals met: 0 of 8
2. (load robot1 depot box1 carrier1 capacity_3 capacity_4)
   deleted: (box-at box1 depot) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box1) (capacity carrier1 capacity_3)
   goals met: 0 of 8
3. (move robot1 carrier1 depot loc1)
   deleted: (robot-at robot1 depot) (carrier-at carrier1 depot)
   added: (robot-at robot1 loc1) (carrier-at carrier1 loc1)
   goals met: 0 of 8
4. (unload robot1 loc1 box1 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box1)
   added: (box-at box1 loc1) (capacity carrier1 capacity_4)
   goals met: 0 of 8
5. (empty robot1 loc1 box1 hammer person1)
   deleted: (box-contains box1 hammer) (box-full box1)
   added: (person-has person1 hammer)
   goals met: 1 of 8
6. (move robot1 carrier1 loc1 depot)
   deleted: (robot-at robot1 loc1) (carrier-at carrier1 loc1)
   added: (robot-at robot1 depot) (carrier-at carrier1 depot)
   goals met: 1 of 8
7. (fill robot1 box4 banana depot)
   added: (box-full box4) (box-contains box4 banana)
   goals met: 1 of 8
8. (load robot1 depot box4 carrier1 capacity_3 capacity_4)
   deleted: (box-at box4 depot) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box4) (capacity carrier1 capacity_3)
   goals met: 1 of 8
9. (move robot1 carrier1 depot loc3)
   deleted: (robot-at robot1 depot) (carrier-at carrier1 depot)
   added: (robot-at robot1 loc3) (carrier-at carrier1 loc3)
   goals met: 1 of 8
10. (unload robot1 loc3 box4 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box4)
   added: (box-at box4 loc3) (capacity carrier1 capacity_4)
   goals met: 1 of 8
11. (empty robot1 loc3 box4 banana person2)
   deleted: (box-contains box4 banana) (box-full box4)
   added: (person-has person2 banana)
   goals met: 2 of 8
12. (move robot1 carrier1 loc3 depot)
   deleted: (robot-at robot1 loc3) (carrier-at carrier1 loc3)
   added: (robot-at robot1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 8
13. (fill robot1 box3 hammer depot)
   added: (box-full box3) (box-contains box3 hammer)
   goals met: 2 of 8
14. (load robot1 depot box3 carrier1 capacity_3 capacity_4)
   deleted: (box-at box3 depot) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box3) (capacity carrier1 capacity_3)
   goals met: 2 of 8
15. (move robot1 carrier1 depot loc4)
   deleted: (robot-at robot1 depot) (carrier-at carrier1 depot)
   added: (robot-at robot1 loc4) (carrier-at carrier1 loc4)
   goals met: 2 of 8
16. (unload robot1 loc4 box3 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box3)
   added: (box-at box3 loc4) (capacity carrier1 capacity_4)
   goals met: 2 of 8
17. (empty robot1 loc4 box3 hammer person3)
   deleted: (box-contains box3 hammer) (box-full box3)
   added: (person-has person3 hammer)
   goals met: 3 of 8
18. (load robot1 loc4 box3 carrier1 capacity_3 capacity_4)
   deleted: (box-at box3 loc4) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box3) (capacity carrier1 capacity_3)
   goals met: 3 of 8
19. (move robot1 carrier1 loc4 depot)
   deleted: (robot-at robot1 loc4) (carrier-at carrier1 loc4)
   added: (robot-at robot1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 8
20. (unload robot1 depot box3 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box3)
   added: (box-at box3 depot) (capacity carrier1 capacity_4)
   goals met: 3 of 8
21. (fill robot1 box3 xanax depot)
   added: (box-full box3) (box-contains box3 xanax)
   goals met: 3 of 8
22. (load robot1 depot box3 carrier1 capacity_3 capacity_4)
   deleted: (box-at box3 depot) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box3) (capacity carrier1 capacity_3)
   goals met: 3 of 8
23. (move robot1 carrier1 depot loc4)
   deleted: (robot-at robot1 depot) (carrier-at carrier1 depot)
   added: (robot-at robot1 loc4) (carrier-at carrier1 loc4)
   goals met: 3 of 8
24. (unload robot1 loc4 box3 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box3)
   added: (box-at box3 loc4) (capacity carrier1 capacity_4)
   goals met: 3 of 8
25. (empty robot1 loc4 box3 xanax person3)
   deleted: (box-contains box3 xanax) (box-full box3)
   added: (person-has person3 xanax)
   goals met: 4 of 8
26. (move robot1 carrier1 loc4 loc2)
   deleted: (robot-at robot1 loc4) (carrier-at carrier1 loc4)
   added: (robot-at robot1 loc2) (carrier-at carrier1 loc2)
   goals met: 4 of 8
27. (move robot1 carrier1 loc2 depot)
   deleted: (robot-at robot1 loc2) (carrier-at carrier1 loc2)
   added: (robot-at robot1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 8
28. (fill robot1 box2 bendage depot)
   added: (box-full box2) (box-contains box2 bendage)
   goals met: 4 of 8
29. (load robot1 depot box2 carrier1 capacity_3 capacity_4)
   deleted: (box-at box2 depot) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box2) (capacity carrier1 capacity_3)
   goals met: 4 of 8
30. (move robot1 carrier1 depot loc2)
   deleted: (robot-at robot1 depot) (carrier-at carrier1 depot)
   added: (robot-at robot1 loc2) (carrier-at carrier1 loc2)
   goals met: 4 of 8
31. (unload robot1 loc2 box2 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box2)
   added: (box-at box2 loc2) (capacity carrier1 capacity_4)
   goals met: 4 of 8
32. (empty robot1 loc2 box2 bendage person5)
   deleted: (box-contains box2 bendage) (box-full box2)
   added: (person-has person5 bendage)
   goals met: 5 of 8
33. (load robot1 loc2 box2 carrier1 capacity_3 capacity_4)
   deleted: (box-at box2 loc2) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box2) (capacity carrier1 capacity_3)
   goals met: 5 of 8
34. (move robot1 carrier1 loc2 depot)
   deleted: (robot-at robot1 loc2) (carrier-at carrier1 loc2)
   added: (robot-at robot1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 8
35. (unload robot1 depot box2 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box2)
   added: (box-at box2 depot) (capacity carrier1 capacity_4)
   goals met: 5 of 8
36. (fill robot1 box2 bendage depot)
   added: (box-full box2) (box-contains box2 bendage)
   goals met: 5 of 8
37. (load robot1 depot box2 carrier1 capacity_3 capacity_4)
   deleted: (box-at box2 depot) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box2) (capacity carrier1 capacity_3)
   goals met: 5 of 8
38. (move robot1 carrier1 depot loc6)
   deleted: (robot-at robot1 depot) (carrier-at carrier1 depot)
   added: (robot-at robot1 loc6) (carrier-at carrier1 loc6)
   goals met: 5 of 8
39. (unload robot1 loc6 box2 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box2)
   added: (box-at box2 loc6) (capacity carrier1 capacity_4)
   goals met: 5 of 8
40. (empty robot1 loc6 box2 bendage person6)
   deleted: (box-contains box2 bendage) (box-full box2)
   added: (person-has person6 bendage)
   goals met: 6 of 8
41. (load robot1 loc6 box2 carrier1 capacity_3 capacity_4)
   deleted: (box-at box2 loc6) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box2) (capacity carrier1 capacity_3)
   goals met: 6 of 8
42. (move robot1 carrier1 loc6 depot)
   deleted: (robot-at robot1 loc6) (carrier-at carrier1 loc6)
   added: (robot-at robot1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 8
43. (unload robot1 depot box2 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box2)
   added: (box-at box2 depot) (capacity carrier1 capacity_4)
   goals met: 6 of 8
44. (fill robot1 box2 pizza depot)
   added: (box-full box2) (box-contains box2 pizza)
   goals met: 6 of 8
45. (load robot1 depot box2 carrier1 capacity_3 capacity_4)
   deleted: (box-at box2 depot) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box2) (capacity carrier1 capacity_3)
   goals met: 6 of 8
46. (move robot1 carrier1 depot loc6)
   deleted: (robot-at robot1 depot) (carrier-at carrier1 depot)
   added: (robot-at robot1 loc6) (carrier-at carrier1 loc6)
   goals met: 6 of 8
47. (unload robot1 loc6 box2 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box2)
   added: (box-at box2 loc6) (capacity carrier1 capacity_4)
   goals met: 6 of 8
48. (empty robot1 loc6 box2 pizza person6)
   deleted: (box-contains box2 pizza) (box-full box2)
   added: (person-has person6 pizza)
   goals met: 7 of 8
49. (load robot1 loc6 box2 carrier1 capacity_3 capacity_4)
   deleted: (box-at box2 loc6) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box2) (capacity carrier1 capacity_3)
   goals met: 7 of 8
50. (move robot1 carrier1 loc6 depot)
   deleted: (robot-at robot1 loc6) (carrier-at carrier1 loc6)
   added: (robot-at robot1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 8
51. (unload robot1 depot box2 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box2)
   added: (box-at box2 depot) (capacity carrier1 capacity_4)
   goals met: 7 of 8
52. (fill robot1 box2 xanax depot)
   added: (box-full box2) (box-contains box2 xanax)
   goals met: 7 of 8
53. (load robot1 depot box2 carrier1 capacity_3 capacity_4)
   deleted: (box-at box2 depot) (capacity carrier1 capacity_4)
   added: (carrier-has carrier1 box2) (capacity carrier1 capacity_3)
   goals met: 7 of 8
54. (move robot1 carrier1 depot loc6)
   deleted: (robot-at robot1 depot) (carrier-at carrier1 depot)
   added: (robot-at robot1 loc6) (carrier-at carrier1 loc6)
   goals met: 7 of 8
55. (unload robot1 loc6 box2 carrier1 capacity_3 capacity_4)
   deleted: (capacity carrier1 capacity_3) (carrier-has carrier1 box2)
   added: (box-at box2 loc6) (capacity carrier1 capacity_4)
   goals met: 7 of 8
56. (empty robot1 loc6 box2 xanax person6)
   deleted: (box-contains box2 xanax) (box-full box2)
   added: (person-has person6 xanax)
   goals met: 8 of 8
